
DATASEG
;=============================================================================================================================================
;Program:
	Score dw 0 ; ניקוד של השחקן
	best dw 0 ; הניקוד הכי גבוה שהשחקן הגיע אליו
	xCube dw 180 ; ערך האיקס הגלובלי של הקוביה
	yCube dw 17 ; ערך הוואי הגלובלי של הקוביה
	Speed dw 100 ;המהירות של המשחק
	k db ? ; the key that the user inserted
	SaveIt db ? ; dx מגבה את
	miliSeconds db 0 ; מספר המילי שניות שעברו עד כה
	newMiliseconds db ? ; מספר המילי שניות שעברו עד כה לאחר הלולאה
	timer dw 100 ; מספר אלפיות השנייה שנשארו עד שתעבור שנייה מלאה
	RotateTimer dw 2 ;זמן ההשהייה בין כל סיבוב של הקוביה
	LinesCounter db 0 ; מספר השורות שהושמדו הסיבוב
	color_Of_Lines dw 0F7h ; צבע הקו המחלק את הקוביות
	touchingCheck dw 0 ; משתנה שבודק אם הקוביה נגעה במשהו 
;=============================================================================================================================================
;Cubes:
	startingY dw ? ; ערך הוואי בו מתחילה הקוביה
	Xstart dw ? ; המיקום ההתחלתי של הקוביה שתיווצר
	addX dw ? ; כמה להוסיף לערך האיקס של הקוביה כדי שהיא לא תעבור את הקצה הימני כשהיא נוצרת
	rangeX dw ? ; תווך ערכי האיקס האפשריים ליצירת קוביה בהם
	NumOfCube db ? ; משתנה שמכיל את מספר הקוביה
	PosCounter dw 1 ;אחראי לספור באיזה מצב הקוביה
	position db 0 ; משתנה שמכיל את מצב הקוביה
	CUBEfinal dw ? ; המספר הסופי של הקוביה- לדוגמא: קוביה 7 מצב 3  תיהיה 73
	NumOfStates dw ? ;מספר המצבים שיש לקוביה
	
	xCube1 dw ? ; האיקס של בלוק 1
	yCube1 dw ? ; הוואי של בלוק 1
	xCube2 dw ? ; האיקס של בלוק 2
	yCube2 dw ? ; הוואי של בלוק 2
	xCube3 dw ? ; האיקס של בלוק 3
	yCube3 dw ? ; הוואי של בלוק 3
	xCube4 dw ? ; האיקס של בלוק 4
	yCube4 dw ? ; הוואי של בלוק 4
	ColorBlock dw ? ; צבעם של הבלוקים
	
	Right_Parts dw ? ; כמות השינויים בגובה שיש לצד ימין של הקוביה
	Right_AddToY1 dw ? ; המספר שצריך להוסיף לוואי כדי להגיע לנקודת ההתחלה של הצלע שבודקים
	Right_sideLength1 dw ? ; אורך הצלע שבודקים
	Right_distance1 dw ?; המרחק האופקי מראשית הקוביה שבודקים
	Right_AddToY2 dw ? ; המספר שצריך להוסיף לוואי כדי להגיע לנקודת ההתחלה של הצלע שבודקים
	Right_sideLength2 dw ? ; אורך הצלע שבודקים
	Right_distance2 dw ? ; המרחק האופקי מראשית הקוביה שבודקים
	Right_AddToY3 dw ? ; המספר שצריך להוסיף לוואי כדי להגיע לנקודת ההתחלה של הצלע שבודקים
	Right_sideLength3 dw ? ; אורך הצלע שבודקים
	Right_distance3 dw ? ; המרחק האופקי מראשית הקוביה שבודקים
	
	Left_Parts dw ? ; כמות השינויים בגובה שיש לצד שמאל של הקוביה
	Left_AddToY1 dw ? ; המספר שצריך להוסיף לוואי כדי להגיע לנקודת ההתחלה של הצלע שבודקים
	Left_sideLength1 dw ? ; אורך הצלע שבודקים
	Left_distance1 dw ?; המרחק האופקי מראשית הקוביה שבודקים
	Left_AddToY2 dw ? ; המספר שצריך להוסיף לוואי כדי להגיע לנקודת ההתחלה של הצלע שבודקים
	Left_sideLength2 dw ? ; אורך הצלע שבודקים
	Left_distance2 dw ? ; המרחק האופקי מראשית הקוביה שבודקים
	Left_AddToY3 dw ? ; המספר שצריך להוסיף לוואי כדי להגיע לנקודת ההתחלה של הצלע שבודקים
	Left_sideLength3 dw ? ; אורך הצלע שבודקים
	Left_distance3 dw ? ; המרחק האופקי מראשית הקוביה שבודקים
		
	Floor_Parts dw ? ; כמות השינויים בגובה שיש לבסיס הקוביה
	Floor_AddToX1 dw ? ; המספר שצריך להוסיף לאיקס כדי להגיע לנקודת ההתחלה של הצלע שבודקים
	Floor_sideLength1 dw ? ; אורך הבסיס שבודקים
	Floor_distance1 dw ?; המרחק האנכי מראשית הקוביה שבודקים
	Floor_AddToX2 dw ? ; המספר שצריך להוסיף לאיקס כדי להגיע לנקודת ההתחלה של הצלע שבודקים
	Floor_sideLength2 dw ? ; אורך הבסיס שבודקים
	Floor_distance2 dw ?; המרחק האנכי מראשית הקוביה שבודקים
	Floor_AddToX3 dw ? ; המספר שצריך להוסיף לאיקס כדי להגיע לנקודת ההתחלה של הצלע שבודקים
	Floor_sideLength3 dw ? ; אורך הבסיס שבודקים
	Floor_distance3 dw ?; המרחק האנכי מראשית הקוביה שבודקים

	xRotate1 dw ?  ; כמה שצריך הוסיף לאיקס הקוביה מראשית הקוביה כדי להגיע לפיקסל שבודקים
	yRotate1 dw ? ; כמה שצריך להוסיף לוואי הקוביה מראשית הצירים כדי להגיע לפיקסל שבודקים
	xRotate2 dw ?  ; כמה שצריך הוסיף לאיקס הקוביה מראשית הקוביה כדי להגיע לפיקסל שבודקים
	yRotate2 dw ? ; כמה שצריך להוסיף לוואי הקוביה מראשית הצירים כדי להגיע לפיקסל שבודקים
	xRotate3 dw ?  ; כמה שצריך הוסיף לאיקס הקוביה מראשית הקוביה כדי להגיע לפיקסל שבודקים
	yRotate3 dw ? ; כמה שצריך להוסיף לוואי הקוביה מראשית הצירים כדי להגיע לפיקסל שבודקים
;=============================================================================================================================================
; Files(bmp):
	filenamee dw ? ; משתנה שמכיל את האופסט של הקובץ שרוצים לפתוח
	filehandle dw ? ; משתנה המצביע על מיקום הקובץ בזיכרון
	ErrorMsg db 'Error', 10, 13,'$' ; הודעת שגיאה שמתקבלת כאשר יש בעיה בפתיחת הקובץ
	Buffer db 10 dup(0) ; משתנה שמייצג את הבאפר
	TetrisTitle db 'tetris.bmp',0 ; תמונה של מסך הפתיחה של טטריס
	KeyBoardInfo db 'KeyBoard.bmp',0 ; תמונה של הסבר על איך משתמשים במקלדת במשחק
	instructions db 'HTPlay.bmp',0 ; תמונה של איך לשחק
	ModesPage db 'Modes.bmp', 0 ; תמונה של מסך כל המודים
	Menu db 'Menu.bmp',0 ; תמונה של מסך התפריט הראשי
	quitScreen db 'quit.bmp', 0 ; תמונה של מסך יציאה מהמשחק
	endScreen db 'End.bmp', 0 ; תמונה שמופיע ברגע שהמשתמש יצא מהמשחק
	GameOverScreen db 'GameOver.bmp', 0 ; תמונה שמופיע כשהשחקן נפסל
	Loading1 db 'Loading1.bmp', 0 ; תמונת הטעינה הראשונה
	Loading2 db 'Loading2.bmp', 0 ; תמונת הטעינה השנייה
	Loading3 db 'Loading3.bmp', 0 ; תמונת הטעינה השלישית
	Header db 54 dup (0) 
	Palette  db 256*4 dup (0) ; משתנה שמכיל את הפלטה
	ScrLine db 320 dup (0) 
;=============================================================================================================================================
;Messages:
	endMessage db 10, 13,'Itay Biran- Assembly Tetris - 3.6.2020', 10, 13, '$' ; הודעה שמופיע בסיום המשחק
	TopMessage db 'Score:$' ; הודעת הניקוד
	BestMessage db 'Best:$' ; הודעת השיא
	TimeMessage db 'Time:$' ; הודעת הזמן
	classic_Message db 'Classic$' ; הודעת המוד הקלאסי
	TurtleSpeed_Message db 'Turtle Speed$' ; הודעת מוד מהירות הצב
	SuperHard_Message db 'Super Hard$' ; הודעת מוד הסופר קשה
	SpiderMan_Message db 'Spider-Man$' ; הודעת מוד הספיידרמן
	OneByOne_Message db 'One By One$' ; הודעת מוד האחד על אחד
	CrazyBoard_Message db 'Crazy Board$' ; הודעת מוד הלוח המשוגע
	NoRotations_Message db 'No Rotaitions$' ; הודעת מוד הללא סיבובים
	Israel_Message db 'Israel$' ; הודעת מוד הישראל
	TinyBoard_Message db 'Tiny Board$' ; הודעת מוד הלוח הקטן
;=============================================================================================================================================	
;TIME:
	Clock db '00:00' ;משתנה שמייצג את הזמן להדפסה בפורמט ##:## כזה
	DLHolder db 0 ; משתנה שמחזיק את די אל- מאיות השנייה
	InternalClock dw 0 ;סופר טיקים של השעון- כל 18 כאלו הם שנייה
	seconds db 0 ; משתנה שמייצג את השניות שעברו
	minutes db 0 ; משתנה שמייצג את הדקות שעברו
;=============================================================================================================================================
;Music:
	counter_mili dw 0 ; count tiks
	time_check db 0 ;check the time
	former_note dw 0 ;התו הקודם שהתנגן
;=============================================================================================================================================
;Mouse:
	check_pressed db 0 ; שווה אחד עם העכבר נלחץ ואפס אם לא
	mouse_x dw ? ;מיקום אנכי של העכבר
	mouse_y dw ? ;מיקום אופקי של העכבר
;=============================================================================================================================================
;Modes:
	mode db 0 ; מסמל את המוד שהמשחק נמצא בו
	Spiderman_check db 0 ;בודק אם השמתמש בחר במוד הספיידרמן
	OneByOne_check db 0 ;בודק אם המשתמש בחר את מוד הקוביה האחת
	Rainbow_check db 0 ;בודק אם המשתמש בחר את מוד הצבעוני
	NoRorations_check db 0 ; בודק אם המשתמש בחר במוד הבלי להסתובב
	Israel_check db 0 ;בודק אם המשתמש בחר במוד הישראלי
;=============================================================================================================================================
; Files(txt):	
	filename_HighScore db 'highScor.txt',0 ; קובץ שמכיל את השיא של השחקן
	first_digit db ? ; ספרת האלפים של השיא
	second_digit db ? ; ספרת המאות של השיא
	third_digit db ? ; ספרת העשרות של השיא
	fourth_digit db ? ; ספרת היחידות של השיא